notes/talks/new_year_raku/A3-raku_drawbacks.md
- [Drawbacks](#org1d2d01a)
  - [start-up speed is slow](#org8a37613)
    - [but Jonathan Worthington is on it](#org4fe04ca)
  - [language is huge](#org72adea6)
    - [an advantage: need fewer extenions libraries; it's multi-paradigm, etc](#org8d0c7ed)
    - [BUT: while getting started not too bad, becoming expert can take long](#org23d8374)
  - [experts vs newbies](#org6a72a8e)
    - [the insiders have been on this for decades](#orgd93d34e)
    - [many disputes, albiet minor ones:](#org0a7deb0)
  - [project setup/design](#org3041710)
    - [reservations about "the tests are the spec"](#org61454d8)
    - ["OOP all the way down" => no clear boundary between internals and externals](#org1246f8f)


<a id="org1d2d01a"></a>

# Drawbacks


<a id="org8a37613"></a>

## start-up speed is slow


<a id="org4fe04ca"></a>

### but Jonathan Worthington is on it

1.  the "new AST project"


<a id="org72adea6"></a>

## language is huge


<a id="org8d0c7ed"></a>

### an advantage: need fewer extenions libraries; it's multi-paradigm, etc


<a id="org23d8374"></a>

### BUT: while getting started not too bad, becoming expert can take long


<a id="org6a72a8e"></a>

## experts vs newbies


<a id="orgd93d34e"></a>

### the insiders have been on this for decades


<a id="org0a7deb0"></a>

### many disputes, albiet minor ones:

1.  is an error message confusing, is that documentation sketchy?

2.  peeve: code examples that don't stay on point, always want to show all the features

    1.  (but please don't expect much better from me)


<a id="org3041710"></a>

## project setup/design


<a id="org61454d8"></a>

### reservations about "the tests are the spec"

1.  opinion: the tests are the tests&#x2013; resist mission creep


<a id="org1246f8f"></a>

### "OOP all the way down" => no clear boundary between internals and externals

1.  good in some ways: small step for a Raku expert to become a core dev

2.  bad in others: few limits to what an expert needs to know
